# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"

# Core packages
brew "tmux"
brew "mise"
brew "opencode"
brew "lazygit"
brew "lazydocker"
brew "starship"
brew "zoxide"
brew "eza"
brew "jq"
brew "gum"
brew "gh"
brew "tailscale"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "aerospace"

# GUI Applications
cask "1password"
cask "docker-desktop"
cask "google-chrome"
cask "dropbox"
cask "spotify"
cask "signal"
cask "whatsapp"
cask "obsidian"
cask "claude-code"
cask "raycast"
cask "zoom"
